app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "email" = ?, "phone" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["email", "asim@devsinc.com"], ["phone", "090078601"], ["updated_at", "2021-07-02 12:48:50.759402"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)